JshStadler/esp32-secure-ble-key/ESP32-C3_Firmware/sdkconfig.defaults
# ============================================================
# BLE Car Unlock Bridge - sdkconfig.defaults
# ESP32-C3 power-optimised BLE peripheral
# ============================================================

# ---- Target ----
CONFIG_IDF_TARGET="esp32c3"

# ---- Power Management & Dynamic Frequency Scaling ----
# Enable PM subsystem (required for DFS and auto light sleep)
CONFIG_PM_ENABLE=y

# DFS: CPU scales between max_freq and min_freq automatically.
# Actual limits are set at runtime via esp_pm_configure().
# max=80 MHz (PLL), min=10 MHz (XTAL/4 on C3, actual floor
# depends on APB consumers — NimBLE needs >=10 MHz).
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y

# FreeRTOS tickless idle: allows the CPU to enter light sleep
# when no tasks are ready to run (instead of busy-looping in
# the idle task). This is what makes auto light sleep work.
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Tick rate: 1000 Hz gives 1ms resolution for vTaskDelay.
# Tickless idle suppresses ticks during sleep, so high tick
# rate doesn't cost power — it only improves timing precision.
CONFIG_FREERTOS_HZ=1000

# ---- Light Sleep / Power ----
# Allow light sleep in the power management framework.
# When all tasks are idle and no locks prevent it, the CPU
# enters light sleep automatically. Wake sources: BLE
# controller interrupts, timers, GPIO.
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y

# Power down flash during light sleep (saves ~1mA).
# Requires flash to support suspend/resume — most do.
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y

# ---- Wi-Fi: unused at runtime ----
# ESP-IDF 6 makes ESP_WIFI_ENABLED a hidden SoC option and NimBLE's controller
# component declares an esp_wifi build dependency for coexistence helpers.
# Firmware never initializes Wi-Fi, creates a netif, or starts its radio.

# ---- Bluetooth / NimBLE ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Use NimBLE host (not Bluedroid)
CONFIG_BT_CONTROLLER_ENABLED=y

# Max connections: match firmware's MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

# Reduce NimBLE log noise (0=DEBUG,1=INFO,2=WARNING,3=ERROR,4=CRITICAL)
CONFIG_BT_NIMBLE_LOG_LEVEL=2

# Keep BLE controller modem sleep disabled for reliability.
# On the current ESP32-C3/ESP-IDF build it still logs that automatic
# light sleep cannot apply while Bluetooth is enabled, and enabling it
# made phone + watch behavior less reliable.
CONFIG_BT_NIMBLE_SLEEP_ENABLE=n
# CONFIG_BT_CTRL_MODEM_SLEEP is not set

# Disable unused NimBLE roles to save flash/RAM
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y

# ---- NVS ----
CONFIG_NVS_FLASH_ENABLED=y

# ---- Logging ----
# Compile logging out of production. Debug builds must change these settings
# together with enabling the console and defining DEBUG in main.c.
# 0=NONE, 1=ERROR, 2=WARN, 3=INFO, 4=DEBUG, 5=VERBOSE
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

# ---- USB Console ----
# Disable both console routes and the application USB Serial/JTAG controller in
# production. The ROM bootloader still provides USB flashing/recovery while the
# BOOT strap is held; no USB/JTAG-disabling eFuses are burned.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# CONFIG_USJ_ENABLE_USB_SERIAL_JTAG is not set

# ---- OTA partitioning and update safety ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Verify every OTA image against our RSA signing key. Hardware Secure Boot is
# deliberately NOT enabled, so USB recovery remains available on a prototype.
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
CONFIG_SECURE_BOOT_SIGNING_KEY="secure_boot_signing_key.pem"

# ---- Watchdog ----
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=n

# ---- Optimisation ----
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# ---- Flash: 4MB on C3 SuperMini ----
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ---- mbedTLS (for HMAC-SHA256) ----
CONFIG_MBEDTLS_HARDWARE_SHA=y

# Disable certificate bundle (not needed, avoids build error)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n
